clydebarrow/usb/bootload/cy8c24094/cy8c24x94.h
#ifndef _CY8C24X94_H
#define _CY8C24X94_H

//=============================================================================
//=============================================================================
//      Register Space, Bank 0
//=============================================================================
//=============================================================================

//-----------------------------------------------
//  Port Registers
//  Note: Also see this address range in Bank 1.
//-----------------------------------------------
// Port 0
volatile __ioport unsigned char	PRT0DR @	0x000;	// Port 0 Data Register
volatile __ioport unsigned char	PRT0IE @	0x001;	// Port 0 Interrupt Enable Register
volatile __ioport unsigned char	PRT0GS @	0x002;	// Port 0 Global Select Register
volatile __ioport unsigned char	PRT0DM2 @	0x003;	// Port 0 Drive Mode 2
// Port 1
volatile __ioport unsigned char	PRT1DR @	0x004;	// Port 1 Data Register
volatile __ioport unsigned char	PRT1IE @	0x005;	// Port 1 Interrupt Enable Register
volatile __ioport unsigned char	PRT1GS @	0x006;	// Port 1 Global Select Register
volatile __ioport unsigned char	PRT1DM2 @	0x007;	// Port 1 Drive Mode 2
// Port 2
volatile __ioport unsigned char	PRT2DR @	0x008;	// Port 2 Data Register
volatile __ioport unsigned char	PRT2IE @	0x009;	// Port 2 Interrupt Enable Register
volatile __ioport unsigned char	PRT2GS @	0x00A;	// Port 2 Global Select Register
volatile __ioport unsigned char	PRT2DM2 @	0x00B;	// Port 2 Drive Mode 2
// Port 3
volatile __ioport unsigned char	PRT3DR @	0x00C;	// Port 3 Data Register
volatile __ioport unsigned char	PRT3IE @	0x00D;	// Port 3 Interrupt Enable Register
volatile __ioport unsigned char	PRT3GS @	0x00E;	// Port 3 Global Select Register
volatile __ioport unsigned char	PRT3DM2 @	0x00F;	// Port 3 Drive Mode 2
// Port 4
volatile __ioport unsigned char	PRT4DR @	0x010;	// Port 4 Data Register
volatile __ioport unsigned char	PRT4IE @	0x011;	// Port 4 Interrupt Enable Register
volatile __ioport unsigned char	PRT4GS @	0x012;	// Port 4 Global Select Register
volatile __ioport unsigned char	PRT4DM2 @	0x013;	// Port 4 Drive Mode 2
// Port 5
volatile __ioport unsigned char	PRT5DR @	0x014;	// Port 5 Data Register
volatile __ioport unsigned char	PRT5IE @	0x015;	// Port 5 Interrupt Enable Register
volatile __ioport unsigned char	PRT5GS @	0x016;	// Port 5 Global Select Register
volatile __ioport unsigned char	PRT5DM2 @	0x017;	// Port 5 Drive Mode 2
// Port 7
volatile __ioport unsigned char	PRT7DR @	0x01C;	// Port 7 Data Register
volatile __ioport unsigned char	PRT7IE @	0x01D;	// Port 7 Interrupt Enable Register
volatile __ioport unsigned char	PRT7GS @	0x01E;	// Port 7 Global Select Register
volatile __ioport unsigned char	PRT7DM2 @	0x01F;	// Port 7 Drive Mode 2

//-----------------------------------------------
//  Digital PSoC(tm) block Registers
//  Note: Also see this address range in Bank 1.
//-----------------------------------------------

// Digital PSoC block 00, Basic Type B
volatile __ioport unsigned char	DBB00DR0 @	0x020;	// data register 0
volatile __ioport unsigned char	DBB00DR1 @	0x021;	// data register 1
volatile __ioport unsigned char	DBB00DR2 @	0x022;	// data register 2
volatile __ioport unsigned char	DBB00CR0 @	0x023;	// control & status register 0

// Digital PSoC block 01, Basic Type B
volatile __ioport unsigned char	DBB01DR0 @	0x024;	// data register 0
volatile __ioport unsigned char	DBB01DR1 @	0x025;	// data register 1
volatile __ioport unsigned char	DBB01DR2 @	0x026;	// data register 2
volatile __ioport unsigned char	DBB01CR0 @	0x027;	// control & status register 0

// Digital PSoC block 02, Communication Type B
volatile __ioport unsigned char	DCB02DR0 @	0x028;	// data register 0
volatile __ioport unsigned char	DCB02DR1 @	0x029;	// data register 1
volatile __ioport unsigned char	DCB02DR2 @	0x02A;	// data register 2
volatile __ioport unsigned char	DCB02CR0 @	0x02B;	// control & status register 0

// Digital PSoC block 03, Communication Type B
volatile __ioport unsigned char	DCB03DR0 @	0x02C;	// data register 0
volatile __ioport unsigned char	DCB03DR1 @	0x02D;	// data register 1
volatile __ioport unsigned char	DCB03DR2 @	0x02E;	// data register 2
volatile __ioport unsigned char	DCB03CR0 @	0x02F;	// control & status register 0

//-----------------------------------------------
// PMA Data Registers
//-----------------------------------------------

volatile __ioport unsigned char	PMA0_DR @	0x040;	// PMA 0 data register
volatile __ioport unsigned char	PMA1_DR @	0x041;	// PMA 1 data register
volatile __ioport unsigned char	PMA2_DR @	0x042;	// PMA 2 data register
volatile __ioport unsigned char	PMA3_DR @	0x043;	// PMA 3 data register
volatile __ioport unsigned char	PMA4_DR @	0x044;	// PMA 4 data register
volatile __ioport unsigned char	PMA5_DR @	0x045;	// PMA 5 data register
volatile __ioport unsigned char	PMA6_DR @	0x046;	// PMA 6 data register
volatile __ioport unsigned char	PMA7_DR @	0x047;	// PMA 7 data register

//-----------------------------------------------
//  USB Control Registers
//-----------------------------------------------
volatile __ioport unsigned char	USB_SOF0 @	0x048;	// USB SOF LSB Byte
volatile __ioport unsigned char	USB_SOF1 @	0x049;	// USB SOF MSB Byte

volatile __ioport unsigned char	USB_CR0 @	0x04A;	// USB Control Register 0
#define USB_CR0_ENABLE      (0x80)
#define USB_CR0_DEVICE_ADDR (0x7F)

volatile __ioport unsigned char	USBIO_CR0 @	0x04B;	// USBIO Control Register 0
#define USBIO_CR0_TEN       (0x80)
#define USBIO_CR0_TSE0      (0x40)
#define USBIO_CR0_TD        (0x20)
#define USBIO_CR0_RD        (0x01)

volatile __ioport unsigned char	USBIO_CR1 @	0x04C;	// USBIO Control Register 1
#define USBIO_CR1_IOMODE    (0x80)
#define USBIO_CR1_DRV_MODE  (0x40)
#define USBIO_CR1_DPI       (0x20)
#define USBIO_CR1_DMI       (0x10)
#define USBIO_CR1_PS2PUEN   (0x08)
#define USBIO_CR1_USBPUEN   (0x04)
#define USBIO_CR1_DPO       (0x02)
#define USBIO_CR1_DMO       (0x01)

//-----------------------------------------------
//  Endpoint Registers
//-----------------------------------------------
volatile __ioport unsigned char	EP1_CNT1 @	0x04E;	// EP1 Count Register 1
#define EP1_CNT1_DATA_TOGGLE (0x80)
#define EP1_CNT1_DATA_VALID  (0x40)
#define EP1_CNT1_CNT_MSB     (0x01)

volatile __ioport unsigned char	EP1_CNT @	0x04F;	// EP1 Count Register 0

volatile __ioport unsigned char	EP2_CNT1 @	0x050;	// EP2 Count Register 1
#define EP2_CNT1_DATA_TOGGLE (0x80)
#define EP2_CNT1_DATA_VALID  (0x40)
#define EP2_CNT1_CNT_MSB     (0x01)

volatile __ioport unsigned char	EP2_CNT @	0x051;	// EP2 Count Register 0

volatile __ioport unsigned char	EP3_CNT1 @	0x052;	// EP3 Count Register 1
#define EP3_CNT1_DATA_TOGGLE (0x80)
#define EP3_CNT1_DATA_VALID  (0x40)
#define EP3_CNT1_CNT_MSB     (0x01)

volatile __ioport unsigned char	EP3_CNT @	0x053;	// EP3 Count Register 0

volatile __ioport unsigned char	EP4_CNT1 @	0x054;	// EP4 Count Register 1
#define EP4_CNT1_DATA_TOGGLE (0x80)
#define EP4_CNT1_DATA_VALID  (0x40)
#define EP4_CNT1_CNT_MSB     (0x01)

volatile __ioport unsigned char	EP4_CNT @	0x055;	// EP4 Control Register

volatile __ioport unsigned char	EP0_CR @	0x056;	// EP0 Control Register

volatile __ioport unsigned char	EP1_CR @	0x0C4;	// EP1 Control Register

#define EP0_CR_SETUP_RCVD    (0x80)
#define EP0_CR_IN_RCVD       (0x40)
#define EP0_CR_OUT_RCVD      (0x20)
#define EP0_CR_ACKD          (0x10)
#define EP0_CR_MODE          (0x0F)

// USB endpoint modes. Only defining the ones we're interested in
//
#define	USBMODE_CTRL_IDLE		0x1		// accept control transfers, NAK others
#define	USBMODE_CTRL_ACK		0xB		// control transfer successful
#define	USBMODE_CTRL_DONE		0x2		// control transfer complete
#define	USBMODE_CTRL_STALL		0x3		// stall in/out
#define	USBMODE_CTRL_IN			0xF		// accept control transfers, ack IN, accept 0 for out
#define	USBMODE_CTRL_IN0		0x6		// accept control transfers, reply to in with 0 bytes
#define	USBMODE_ACKIN			0xD		// data is ready to send to IN request
#define	USBMODE_NAKIN			0xC		// in fifo empty
#define	USBMODE_ACKOUT			0x9		// Ready to receive data
#define	USBMODE_NAKOUT			0x8		// out fifo has data, nak further outs
#define USBMODE_ISOOUT			0x5
#define USBMODE_ISOIN			0x7

