clydebarrow/usb/bootload/cy8c24094/cy8c24x94.h
volatile __ioport unsigned char	EP0_CNT @	0x057;	// EP0 Count Register
#define EP0_CNT_DATA_TOGGLE (0x80)
#define EP0_CNT_DATA_VALID  (0x40)
#define EP0_CNT_BYTE_CNT    (0x0F)

volatile __ioport unsigned char	EP0_DR[8] @	0x058;	// EP0 Data Register array
volatile __ioport unsigned char	EP0_DR0 @	0x058;	// EP0 Data Register 0
volatile __ioport unsigned char	EP0_DR1 @	0x059;	// EP0 Data Register 0
volatile __ioport unsigned char	EP0_DR2 @	0x05A;	// EP0 Data Register 0
volatile __ioport unsigned char	EP0_DR3 @	0x05B;	// EP0 Data Register 0
volatile __ioport unsigned char	EP0_DR4 @	0x05C;	// EP0 Data Register 0
volatile __ioport unsigned char	EP0_DR5 @	0x05D;	// EP0 Data Register 0
volatile __ioport unsigned char	EP0_DR6 @	0x05E;	// EP0 Data Register 0
volatile __ioport unsigned char	EP0_DR7 @	0x05F;	// EP0 Data Register 0

//-----------------------------------------------
//  Analog Control Registers
//-----------------------------------------------

volatile __ioport unsigned char	AMX_IN @	0x060;	// Analog Input Multiplexor Control
#define AMX_IN_ACI1       (0x0C)
#define AMX_IN_ACI0       (0x03)

volatile __ioport unsigned char	AMUXCFG @	0x061;	// Analog MUX Configuration
#define AMUXCFG_BCOL1MUX  (0x80)
#define AMUXCFG_ACOLOMUX  (0x40)
#define AMUXCFG_INTCAP    (0x30)
#define AMUXCFG_MUXCLK    (0x0E)
#define AMUXCFG_EN        (0x01)

volatile __ioport unsigned char	ARF_CR @	0x063;	// Analog Reference Control Register
#define ARF_CR_HBE      (0x40)
#define ARF_CR_REF      (0x38)
#define ARF_CR_REFPWR   (0x07)
#define ARF_CR_SCPWR    (0x03)

volatile __ioport unsigned char	CMP_CR0 @	0x064;	// Analog Comparator Bus Register 0
#define CMP_CR0_COMP1    (0x20)
#define CMP_CR0_COMP0    (0x10)
#define CMP_CR0_AINT1    (0x02)
#define CMP_CR0_AINT0    (0x01)

volatile __ioport unsigned char	ASY_CR @	0x065;	// Analog Synchronizaton Control Register
#define ASY_CR_SARCOUNT (0x70)
#define ASY_CR_SARSIGN  (0x08)
#define ASY_CR_SARCOL   (0x06)
#define ASY_CR_SYNCEN   (0x01)

volatile __ioport unsigned char	CMP_CR1 @	0x066;	// Analog Comparator Bus Register 1
#define CMP_CR1_CLDIS1  (0x20)
#define CMP_CR1_CLDIS0  (0x10)
#define CMP_CR1_CLK1X1  (0x02)
#define CMP_CR1_CLK1X0  (0x01)


//-----------------------------------------------
//  Analog PSoC block Registers
//
//  Note: the following registers are mapped into
//  both register bank 0 AND register bank 1.
//-----------------------------------------------

// Continuous Time PSoC Block Type B Row 0 Col 0
volatile __ioport unsigned char	ACB00CR3 @	0x70;	// Control register 3
volatile __ioport unsigned char	ACB00CR0 @	0x71;	// Control register 0
volatile __ioport unsigned char	ACB00CR1 @	0x72;	// Control register 1
volatile __ioport unsigned char	ACB00CR2 @	0x73;	// Control register 2

// Continuous Time PSoC Block Type B Row 0 Col 1
volatile __ioport unsigned char	ACB01CR3 @	0x74;	// Control register 3
volatile __ioport unsigned char	ACB01CR0 @	0x75;	// Control register 0
volatile __ioport unsigned char	ACB01CR1 @	0x76;	// Control register 1
volatile __ioport unsigned char	ACB01CR2 @	0x77;	// Control register 2

// Switched Cap PSoC Block Type C Row 1 Col 0
volatile __ioport unsigned char	ASC10CR0 @	0x80;	// Control register 0
volatile __ioport unsigned char	ASC10CR1 @	0x81;	// Control register 1
volatile __ioport unsigned char	ASC10CR2 @	0x82;	// Control register 2
volatile __ioport unsigned char	ASC10CR3 @	0x83;	// Control register 3

// Switched Cap PSoC Block Type D Row 1 Col 1
volatile __ioport unsigned char	ASD11CR0 @	0x84;	// Control register 0
volatile __ioport unsigned char	ASD11CR1 @	0x85;	// Control register 1
volatile __ioport unsigned char	ASD11CR2 @	0x86;	// Control register 2
volatile __ioport unsigned char	ASD11CR3 @	0x87;	// Control register 3

// Switched Cap PSoC Block Type D Row 2 Col 0
volatile __ioport unsigned char	ASD20CR0 @	0x90;	// Control register 0
volatile __ioport unsigned char	ASD20CR1 @	0x91;	// Control register 1
volatile __ioport unsigned char	ASD20CR2 @	0x92;	// Control register 2
volatile __ioport unsigned char	ASD20CR3 @	0x93;	// Control register 3

// Switched Cap PSoC Block Type C Row 2 Col 1
volatile __ioport unsigned char	ASC21CR0 @	0x94;	// Control register 0
volatile __ioport unsigned char	ASC21CR1 @	0x95;	// Control register 1
volatile __ioport unsigned char	ASC21CR2 @	0x96;	// Control register 2
volatile __ioport unsigned char	ASC21CR3 @	0x97;	// Control register 3

//-----------------------------------------------
//  Global General Purpose Data Registers
//-----------------------------------------------
volatile __ioport unsigned char	TMP_DR0 @	0x6C;	// Temp Data Register 0
volatile __ioport unsigned char	TMP_DR1 @	0x6D;	// Temp Data Register 1
volatile __ioport unsigned char	TMP_DR2 @	0x6E;	// Temp Data Register 2
volatile __ioport unsigned char	TMP_DR3 @	0x6F;	// Temp Data Register 3

//-----------------------------------------------
//  Row Digital Interconnects
//
//  Note: the following registers are mapped into
//  both register bank 0 AND register bank 1.
//-----------------------------------------------

volatile __ioport unsigned char	RDI0RI @	0xB0;	// Row Digital Interconnect Row 0 Input
volatile __ioport unsigned char	RDI0SYN @	0xB1;	// Row Digital Interconnect Row 0 Sync Reg
volatile __ioport unsigned char	RDI0IS @	0xB2;	// Row 0 Input Select Register
volatile __ioport unsigned char	RDI0LT0 @	0xB3;	// Row 0 Look Up Table Register 0
volatile __ioport unsigned char	RDI0LT1 @	0xB4;	// Row 0 Look Up Table Register 1
volatile __ioport unsigned char	RDI0RO0 @	0xB5;	// Row 0 Output Register 0
volatile __ioport unsigned char	RDI0RO1 @	0xB6;	// Row 0 Output Register 1

//-----------------------------------------------
//  Ram Page Pointers
//-----------------------------------------------
volatile __ioport unsigned char	CUR_PP @	0x0D0;	// Current   Page Pointer
volatile __ioport unsigned char	STK_PP @	0x0D1;	// Stack     Page Pointer
volatile __ioport unsigned char	IDX_PP @	0x0D3;	// Index     Page Pointer
volatile __ioport unsigned char	MVR_PP @	0x0D4;	// MVI Read  Page Pointer
volatile __ioport unsigned char	MVW_PP @	0x0D5;	// MVI Write Page Pointer

//-----------------------------------------------
//  I2C Configuration Registers
//-----------------------------------------------
volatile __ioport unsigned char	I2C_CFG @	0x0D6;	// I2C Configuration Register
#define I2C_CFG_PINSEL         (0x40)
#define I2C_CFG_BUSERR_IE      (0x20)
#define I2C_CFG_STOP_IE        (0x10)
#define I2C_CFG_CLK_RATE_100K  (0x00)
#define I2C_CFG_CLK_RATE_400K  (0x04)
#define I2C_CFG_CLK_RATE_50K   (0x08)
#define I2C_CFG_CLK_RATE_1M6   (0x0C)
#define I2C_CFG_CLK_RATE       (0x0C)
#define I2C_CFG_PSELECT_MASTER (0x02)
#define I2C_CFG_PSELECT_SLAVE  (0x01)

volatile __ioport unsigned char	I2C_SCR @	0x0D7;	// I2C Status and Control Register
#define I2C_SCR_BUSERR       (0x80)
#define I2C_SCR_LOSTARB      (0x40)
#define I2C_SCR_STOP         (0x20)
#define I2C_SCR_ACK          (0x10)
#define I2C_SCR_ADDR         (0x08)
#define I2C_SCR_XMIT         (0x04)
#define I2C_SCR_LRB          (0x02)
#define I2C_SCR_BYTECOMPLETE (0x01)

volatile __ioport unsigned char	I2C_DR @	0x0D8;	// I2C Data Register

volatile __ioport unsigned char	I2C_MSCR @	0x0D9;	// I2C Master Status and Control Register
#define I2C_MSCR_BUSY    (0x08)
#define I2C_MSCR_MODE    (0x04)
#define I2C_MSCR_RESTART (0x02)
#define I2C_MSCR_START   (0x01)

//-----------------------------------------------
//  System and Global Resource Registers
//-----------------------------------------------
volatile __ioport unsigned char	INT_CLR0 @	0x0DA;	// Interrupt Clear Register 0
volatile __ioport unsigned char	INT_CLR1 @	0x0DB;	// Interrupt Clear Register 1
volatile __ioport unsigned char	INT_CLR2 @	0x0DC;	// Interrupt Clear Register 2
volatile __ioport unsigned char	INT_CLR3 @	0x0DD;	// Interrupt Clear Register 3

volatile __ioport unsigned char	INT_MSK3 @	0x0DE;	// I2C and Software Mask Register
#define INT_MSK3_ENSWINT          (0x80)
#define INT_MSK3_I2C              (0x01)

volatile __ioport unsigned char	INT_MSK2 @	0x0DF;	// General Interrupt Mask Register
#define  INT_MSK2_WAKEUP          (0x80)
#define  INT_MSK2_EP4             (0x40)
#define  INT_MSK2_EP3             (0x20)
#define  INT_MSK2_EP2             (0x10)
#define  INT_MSK2_EP1             (0x08)
#define  INT_MSK2_EP0             (0x04)
#define  INT_MSK2_SOF             (0x02)
#define  INT_MSK2_BUS_RESET       (0x01)

volatile __ioport unsigned char	INT_MSK0 @	0x0E0;	// General Interrupt Mask Register
#define  INT_MSK0_VC3             (0x80)
#define  INT_MSK0_SLEEP           (0x40)
#define  INT_MSK0_GPIO            (0x20)
#define  INT_MSK0_ACOLUMN_1       (0x04)
#define  INT_MSK0_ACOLUMN_0       (0x02)
#define  INT_MSK0_VOLTAGE_MONITOR (0x01)


volatile __ioport unsigned char	INT_MSK1 @	0x0E1;	// Digital PSoC block Mask Register
#define  INT_MSK1_DCB03           (0x08)
#define  INT_MSK1_DCB02           (0x04)
#define  INT_MSK1_DBB01           (0x02)
#define  INT_MSK1_DBB00           (0x01)

volatile __ioport unsigned char	INT_VC @	0x0E2;	// Interrupt vector register

volatile __ioport unsigned char	RES_WDT @	0x0E3;	// Watch Dog Timer

// DECIMATOR Registers
volatile __ioport unsigned char	DEC_DH @	0x0E4;	// Data Register (high byte)
volatile __ioport unsigned char	DEC_DL @	0x0E5;	// Data Register ( low byte)
volatile __ioport unsigned char	DEC_CR0 @	0x0E6;	// Data Control Register
volatile __ioport unsigned char	DEC_CR1 @	0x0E7;	// Data Control Register

// Multiplier and MAC (Multiply/Accumulate) Unit
volatile __ioport unsigned char	MUL0_X @	0x0E8;	// Multiplier X Register (write)
volatile __ioport unsigned char	MUL0_Y @	0x0E9;	// Multiplier Y Register (write)
volatile __ioport unsigned char	MUL0_DH @	0x0EA;	// Multiplier Result Data (high byte read)
volatile __ioport unsigned char	MUL0_DL @	0x0EB;	// Multiplier Result Data ( low byte read)
volatile __ioport unsigned char	ACC0_DR1 @	0x0EC;	// ACC0_DR1 (write) [see ACC_DR1]
volatile __ioport unsigned char	ACC0_DR0 @	0x0ED;	// ACC0_DR0 (write) [see ACC_DR1]
volatile __ioport unsigned char	ACC0_DR3 @	0x0EE;	// ACC0_DR3 (write) [see ACC_DR1]
volatile __ioport unsigned char	ACC0_DR2 @	0x0EF;	// ACC0_DR2 (write) [see ACC_DR1]
volatile __ioport unsigned char	MAC_Y @	0x0ED;	// MAC Y register (write) [see ACC_DR0]
volatile __ioport unsigned char	MAC_CL0 @	0x0EE;	// MAC Clear Accum (write)[see ACC_DR3]
volatile __ioport unsigned char	MAC_CL1 @	0x0EF;	// MAC Clear Accum (write)[see ACC_DR2]
volatile __ioport unsigned char	ACC_DR1 @	0x0EC;	// MAC Accumulator (Read, byte 1)
volatile __ioport unsigned char	ACC_DR0 @	0x0ED;	// MAC Accumulator (Read, byte 0)
volatile unsigned int	ACC_LOW_WORD @ 0xEC;	// MAC accumulator low word
volatile unsigned int	ACC_HI_WORD @ 0xEE;	// MAC accumulator high word
volatile __ioport unsigned char	ACC_DR3 @	0x0EE;	// MAC Accumulator (Read, byte 3)
volatile __ioport unsigned char	ACC_DR2 @	0x0EF;	// MAC Accumulator (Read, byte 2)

//-----------------------------------------------
//  System Status and Control Register
//
//  Note: the following register is mapped into
//  both register bank 0 AND register bank 1.
//-----------------------------------------------
volatile __ioport unsigned char	CPU_F @	0xF7;	// CPU Flag Register Access

volatile __ioport unsigned char	DAC_D @	0xFD;	// DAC Data Register

volatile __ioport unsigned char	CPU_SCR1 @	0xFE;	// System Status and Control Register 1
#define  CPU_SCR1_IRESS        (0x80)
#define  CPU_SCR1_SLIMO        (0x10)
#define  CPU_SCR1_ECO_ALWD_WR  (0x08)
#define  CPU_SCR1_ECO_ALLOWED  (0x04)
#define  CPU_SCR1_IRAMDIS      (0x01)

