clydebarrow/usb/bootload/cy8c24094/cy8c24x94.h
volatile __ioport unsigned char	CPU_SCR0 @	0xFF;	// System Status and Control Register 0
#define  CPU_SCR0_GIE_MASK     (0x80)
#define  CPU_SCR0_WDRS_MASK    (0x20)
#define  CPU_SCR0_PORS_MASK    (0x10)
#define  CPU_SCR0_SLEEP_MASK   (0x08)
#define  CPU_SCR0_STOP_MASK    (0x01)


//=============================================================================
//=============================================================================
//      Register Space, Bank 1
//=============================================================================
//=============================================================================


//-----------------------------------------------
//  Port Registers
//  Note: Also see this address range in Bank 0.
//-----------------------------------------------
// Port 0
volatile __ioport unsigned char	PRT0DM0 @	0x100;	// Port 0 Drive Mode 0
volatile __ioport unsigned char	PRT0DM1 @	0x101;	// Port 0 Drive Mode 1
volatile __ioport unsigned char	PRT0IC0 @	0x102;	// Port 0 Interrupt Control 0
volatile __ioport unsigned char	PRT0IC1 @	0x103;	// Port 0 Interrupt Control 1
// Port 1
volatile __ioport unsigned char	PRT1DM0 @	0x104;	// Port 1 Drive Mode 0
volatile __ioport unsigned char	PRT1DM1 @	0x105;	// Port 1 Drive Mode 1
volatile __ioport unsigned char	PRT1IC0 @	0x106;	// Port 1 Interrupt Control 0
volatile __ioport unsigned char	PRT1IC1 @	0x107;	// Port 1 Interrupt Control 1
// Port 2
volatile __ioport unsigned char	PRT2DM0 @	0x108;	// Port 2 Drive Mode 0
volatile __ioport unsigned char	PRT2DM1 @	0x109;	// Port 2 Drive Mode 1
volatile __ioport unsigned char	PRT2IC0 @	0x10A;	// Port 2 Interrupt Control 0
volatile __ioport unsigned char	PRT2IC1 @	0x10B;	// Port 2 Interrupt Control 1
// Port 3
volatile __ioport unsigned char	PRT3DM0 @	0x10C;	// Port 3 Drive Mode 0
volatile __ioport unsigned char	PRT3DM1 @	0x10D;	// Port 3 Drive Mode 1
volatile __ioport unsigned char	PRT3IC0 @	0x10E;	// Port 3 Interrupt Control 0
volatile __ioport unsigned char	PRT3IC1 @	0x10F;	// Port 3 Interrupt Control 1
// Port 4
volatile __ioport unsigned char	PRT4DM0 @	0x110;	// Port 4 Drive Mode 0
volatile __ioport unsigned char	PRT4DM1 @	0x111;	// Port 4 Drive Mode 1
volatile __ioport unsigned char	PRT4IC0 @	0x112;	// Port 4 Interrupt Control 0
volatile __ioport unsigned char	PRT4IC1 @	0x113;	// Port 4 Interrupt Control 1
// Port 5
volatile __ioport unsigned char	PRT5DM0 @	0x114;	// Port 5 Drive Mode 0
volatile __ioport unsigned char	PRT5DM1 @	0x115;	// Port 5 Drive Mode 1
volatile __ioport unsigned char	PRT5IC0 @	0x116;	// Port 5 Interrupt Control 0
volatile __ioport unsigned char	PRT5IC1 @	0x117;	// Port 5 Interrupt Control 1
// Port 7
volatile __ioport unsigned char	PRT7DM0 @	0x11C;	// Port 7 Drive Mode 0
volatile __ioport unsigned char	PRT7DM1 @	0x11D;	// Port 7 Drive Mode 1
volatile __ioport unsigned char	PRT7IC0 @	0x11E;	// Port 7 Interrupt Control 0
volatile __ioport unsigned char	PRT7IC1 @	0x11F;	// Port 7 Interrupt Control 1

//-----------------------------------------------
//  Digital PSoC(tm) block Registers
//  Note: Also see this address range in Bank 1.
//-----------------------------------------------

// Digital PSoC block 00, Basic Type B
volatile __ioport unsigned char	DBB00FN @	0x120;	// Function Register
volatile __ioport unsigned char	DBB00IN @	0x121;	//    Input Register
volatile __ioport unsigned char	DBB00OU @	0x122;	//   Output Register

// Digital PSoC block 01, Basic Type B
volatile __ioport unsigned char	DBB01FN @	0x124;	// Function Register
volatile __ioport unsigned char	DBB01IN @	0x125;	//    Input Register
volatile __ioport unsigned char	DBB01OU @	0x126;	//   Output Register

// Digital PSoC block 02, Communications Type B
volatile __ioport unsigned char	DCB02FN @	0x128;	// Function Register
volatile __ioport unsigned char	DCB02IN @	0x129;	//    Input Register
volatile __ioport unsigned char	DCB02OU @	0x12A;	//   Output Register

// Digital PSoC block 03, Communications Type B
volatile __ioport unsigned char	DCB03FN @	0x12C;	// Function Register
volatile __ioport unsigned char	DCB03IN @	0x12D;	//    Input Register
volatile __ioport unsigned char	DCB03OU @	0x12E;	//   Output Register

//-----------------------------------------------
//  PMA Write and Read Pointer Registers
//-----------------------------------------------
volatile __ioport unsigned char	PMA0_WA @	0x140;	// PMA 0 Write Pointer
volatile __ioport unsigned char	PMA1_WA @	0x141;	// PMA 1 Write Pointer
volatile __ioport unsigned char	PMA2_WA @	0x142;	// PMA 2 Write Pointer
volatile __ioport unsigned char	PMA3_WA @	0x143;	// PMA 3 Write Pointer
volatile __ioport unsigned char	PMA4_WA @	0x144;	// PMA 4 Write Pointer
volatile __ioport unsigned char	PMA5_WA @	0x145;	// PMA 5 Write Pointer
volatile __ioport unsigned char	PMA6_WA @	0x146;	// PMA 6 Write Pointer
volatile __ioport unsigned char	PMA7_WA @	0x147;	// PMA 7 Write Pointer

volatile __ioport unsigned char	PMA0_RA @	0x150;	// PMA 0 Read Pointer
volatile __ioport unsigned char	PMA1_RA @	0x151;	// PMA 1 Read Pointer
volatile __ioport unsigned char	PMA2_RA @	0x152;	// PMA 2 Read Pointer
volatile __ioport unsigned char	PMA3_RA @	0x153;	// PMA 3 Read Pointer
volatile __ioport unsigned char	PMA4_RA @	0x154;	// PMA 4 Read Pointer
volatile __ioport unsigned char	PMA5_RA @	0x155;	// PMA 5 Read Pointer
volatile __ioport unsigned char	PMA6_RA @	0x156;	// PMA 6 Read Pointer
volatile __ioport unsigned char	PMA7_RA @	0x157;	// PMA 7 Read Pointer

//-----------------------------------------------
//  System and Global Resource Registers
//  Note: Also see this address range in Bank 0.
//-----------------------------------------------

volatile __ioport unsigned char	CLK_CR0 @	0x160;	// Analog Column Clock Select Register
#define CLK_CR0_ACOLUMN1              (0x0C)
#define CLK_CR0_ACOLUMN0              (0x03)

volatile __ioport unsigned char	CLK_CR1 @	0x161;	// Analog Clock Source Select Register
#define CLK_CR1_SHDIS                 (0x40)
#define CLK_CR1_ACLK1                 (0x38)
#define CLK_CR1_ACLK2                 (0x07)

volatile __ioport unsigned char	ABF_CR0 @	0x162;	// Analog Output Buffer Control Register
#define ABF_CR0_ACOL1MUX              (0x80)
#define ABF_CR0_ABUF1EN               (0x20)
#define ABF_CR0_ABUF0EN               (0x08)
#define ABF_CR0_BYPASS                (0x02)
#define ABF_CR0_PWR                   (0x01)

