clydebarrow/usb/bootload/cy8c24094/cy8c24x94.h
volatile __ioport unsigned char	AMD_CR0 @	0x163;	// Analog Modulator Control Register
#define AMD_CR0_AMOD0                 (0x07)

volatile __ioport unsigned char	CMP_GO_EN @	0x164;	// Comparator Bus To Global Out Enable
#define CMP_GO_EN_GOO5                (0x80)
#define CMP_GO_EN_GOO1                (0x40)
#define CMP_GO_EN_SEL1                (0x30)
#define CMP_GO_EN_GOO4                (0x08)
#define CMP_GO_EN_GOO0                (0x04)
#define CMP_GO_EN_SEL0                (0x03)

volatile __ioport unsigned char	CMP_GO_EN1 @	0x165;	// Comparator Bus To Global Out Enable 1
#define CMP_GO_EN1_GOO7               (0x80)
#define CMP_GO_EN1_GOO3               (0x40)
#define CMP_GO_EN1_SEL3               (0x30)
#define CMP_GO_EN1_GOO6               (0x08)
#define CMP_GO_EN1_GOO2               (0x04)
#define CMP_GO_EN1_SEL2               (0x03)

volatile __ioport unsigned char	AMD_CR1 @	0x166;	// Analog Modulator Control Register 1
#define AMD_CR1_AMOD1                 (0x07)

volatile __ioport unsigned char	ALT_CR0 @	0x167;	// Analog Look Up Table (LUT) Register 0
#define ALT_CR0_LUT1                  (0xF0)
#define ALT_CR0_LUT0                  (0x0F)


//-----------------------------------------------
//  USB Registers
//-----------------------------------------------
volatile __ioport unsigned char	USB_CR1 @	0x1C1;	// USB Control Register 1
#define USB_CR1_BUS_ACTIVITY           (0x04)
#define USB_CR1_ENABLE_LOCK            (0x02)
#define USB_CR1_REG_ENABLE             (0x01)

volatile __ioport unsigned char	EP1_CR0 @	0x1C4;	// Endpoint 1 Control Register 0
#define EP1_CR0_STALL                  (0x80)
#define EP1_CR0_NAK_INT_EN             (0x20)
#define EP1_CR0_ACKD                   (0x10)
#define EP1_CR0_MODE                   (0x0F)

volatile __ioport unsigned char	EP2_CR0 @	0x1C5;	// Endpoint 2 Control Register 0
#define EP2_CR0_STALL                  (0x80)
#define EP2_CR0_NAK_INT_EN             (0x20)
#define EP2_CR0_ACKD                   (0x10)
#define EP2_CR0_MODE                   (0x0F)

volatile __ioport unsigned char	EP3_CR0 @	0x1C6;	// Endpoint 3 Control Register 0
#define EP3_CR0_STALL                  (0x80)
#define EP3_CR0_NAK_INT_EN             (0x20)
#define EP3_CR0_ACKD                   (0x10)
#define EP3_CR0_MODE                   (0x0F)

volatile __ioport unsigned char	EP4_CR0 @	0x1C7;	// Endpoint 4 Control Register 0
#define EP4_CR0_STALL                  (0x80)
#define EP4_CR0_NAK_INT_EN             (0x20)
#define EP4_CR0_ACKD                   (0x10)
#define EP4_CR0_MODE                   (0x0F)

//-----------------------------------------------
//  Global Digital Interconnects
//-----------------------------------------------


volatile __ioport unsigned char	GDI_O_IN @	0x1D0;	// Global Dig Interconnect Odd Inputs
volatile __ioport unsigned char	GDI_E_IN @	0x1D1;	// Global Dig Interconnect Even Inputs
volatile __ioport unsigned char	GDI_O_OU @	0x1D2;	// Global Dig Interconnect Odd Outputs
volatile __ioport unsigned char	GDI_E_OU @	0x1D3;	// Global Dig Interconnect Even Outputs

//------------------------------------------------
//  Analog Mux Bus Select Registers
//------------------------------------------------

volatile __ioport unsigned char	MUX_CR0 @	0x1D8;	// Analog Mux Port 0 Bit Enables
volatile __ioport unsigned char	MUX_CR1 @	0x1D9;	// Analog Mux Port 1 Bit Enables
volatile __ioport unsigned char	MUX_CR2 @	0x1DA;	// Analog Mux Port 2 Bit Enables
volatile __ioport unsigned char	MUX_CR3 @	0x1DB;	// Analog Mux Port 3 Bit Enables
volatile __ioport unsigned char	MUX_CR4 @	0x1EC;	// Analog Mux Port 4 Bit Enables
volatile __ioport unsigned char	MUX_CR5 @	0x1ED;	// Analog Mux Port 5 Bit Enables

//------------------------------------------------
//  Clock and System Control Registers
//------------------------------------------------

volatile __ioport unsigned char	OSC_GO_EN @	0x1DD;	// Oscillator to Global Outputs Enable Register (RW)
#define OSC_GO_EN_SLPINT              (0x80)
#define OSC_GO_EN_VC3                 (0x40)
#define OSC_GO_EN_VC2                 (0x20)
#define OSC_GO_EN_VC1                 (0x10)
#define OSC_GO_EN_SYSCLKX2            (0x08)
#define OSC_GO_EN_SYSCLK              (0x04)
#define OSC_GO_EN_CLK24M              (0x02)
#define OSC_GO_EN_CLK32K              (0x01)

volatile __ioport unsigned char	OSC_CR4 @	0x1DE;	// Oscillator Control Register 4
#define OSC_CR4_VC3SEL                (0x03)

volatile __ioport unsigned char	OSC_CR3 @	0x1DF;	// Oscillator Control Register 3

volatile __ioport unsigned char	OSC_CR0 @	0x1E0;	// System Oscillator Control Register 0
#define OSC_CR0_32K_SELECT            (0x80)
#define OSC_CR0_PLL_MODE              (0x40)
#define OSC_CR0_NO_BUZZ               (0x20)
#define OSC_CR0_SLEEP                 (0x18)
#define OSC_CR0_SLEEP_512Hz           (0x00)
#define OSC_CR0_SLEEP_64Hz            (0x08)
#define OSC_CR0_SLEEP_8Hz             (0x10)
#define OSC_CR0_SLEEP_1Hz             (0x18)
#define OSC_CR0_CPU                   (0x07)
#define OSC_CR0_CPU_3MHz              (0x00)
#define OSC_CR0_CPU_6MHz              (0x01)
#define OSC_CR0_CPU_12MHz             (0x02)
#define OSC_CR0_CPU_24MHz             (0x03)
#define OSC_CR0_CPU_1d5MHz            (0x04)
#define OSC_CR0_CPU_750kHz            (0x05)
#define OSC_CR0_CPU_187d5kHz          (0x06)
#define OSC_CR0_CPU_93d7kHz           (0x07)

volatile __ioport unsigned char	OSC_CR1 @	0x1E1;	// System V1/V2 Divider Control Register
#define OSC_CR1_VC1                   (0xF0)
#define OSC_CR1_VC2                   (0x0F)

volatile __ioport unsigned char	OSC_CR2 @	0x1E2;	// Oscillator Control Register 2
#define OSC_CR2_PLLGAIN               (0x80)
#define OSC_CR2_EXTCLKEN              (0x04)
#define OSC_CR2_IMODIS                (0x02)
#define OSC_CR2_SYSCLKX2DIS           (0x01)

volatile __ioport unsigned char	VLT_CR @	0x1E3;	// Voltage Monitor Control Register
#define VLT_CR_SMP                    (0x80)
#define VLT_CR_PORLEV                 (0x30)
#define VLT_CR_POR_MID                (0x10)
#define VLT_CR_POR_HIGH               (0x20)
#define VLT_CR_LVDTBEN                (0x08)
#define VLT_CR_VM                     (0x07)

volatile __ioport unsigned char	VLT_CMP @	0x1E4;	// Voltage Monitor Comparators Register
#define VLT_CMP_PUMP                  (0x04)
#define VLT_CMP_LVD                   (0x02)
#define VLT_CMP_PPOR                  (0x01)

volatile __ioport unsigned char	DEC_CR2 @	0x1E7;	// Data Control Register

volatile __ioport unsigned char	IMO_TR @	0x1E8;	// Internal Main Oscillator Trim Register
volatile __ioport unsigned char	ILO_TR @	0x1E9;	// Internal Low-speed Oscillator Trim
volatile __ioport unsigned char	BDG_TR @	0x1EA;	// Band Gap Trim Register
volatile __ioport unsigned char	ECO_TR @	0x1EB;	// External Oscillator Trim Register
volatile __ioport unsigned char	IMO_TR2 @	0x1EF;	// Internal Main Oscillator Gain Trim Register

volatile __ioport unsigned char	DAC_CR @	0x1FD;	// DAC Control Register



#define DAC_CR_SPLIT_MUX              (0x80)
#define DAC_CR_MUXCLK_GE              (0x40)
#define DAC_CR_RANGE                  (0x08)
#define DAC_CR_OSCMODE                (0x06)
#define DAC_CR_ENABLE                 (0x01)

// interrupt vectors for the USB stuff

#define	USB_BUS_RESET_VECTOR	0x40
#define	USB_SOF_VECTOR			0x44
#define	USB_EP0_VECTOR			0x48
#define	USB_EP1_VECTOR			0x4C
#define	USB_EP2_VECTOR			0x50
#define	USB_EP3_VECTOR			0x54
#define	USB_EP4_VECTOR			0x58
#define	USB_WAKEUP_VECTOR		0x5C

#endif
